
## Plan Result




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_blob.b2c_config[&#34;0&#34;]
  * azurerm_storage_blob.b2c_config[&#34;1&#34;]
  * azurerm_storage_blob.b2c_config[&#34;12&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_blob.b2c_config["0"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "413ed923925725f42c90895b1ac8e47c"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "css/main.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/css/main.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["1"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "2d511145205655b408407beb2d25a206"
      + content_type           = "text/css"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "css/govuk-frontend-5.2.0.min.css"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/css/govuk-frontend-5.2.0.min.css"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

  # azurerm_storage_blob.b2c_config["12"] will be created
  + resource "azurerm_storage_blob" "b2c_config" {
      + access_tier            = (known after apply)
      + content_md5            = "08c923d1fcc2fe3e69e73bfbf539fa6f"
      + content_type           = "image/x-png"
      + id                     = (known after apply)
      + metadata               = (known after apply)
      + name                   = "assets/images/govuk-opengraph-image.png"
      + parallelism            = 8
      + size                   = 0
      + source                 = "./b2c/views/assets/images/govuk-opengraph-image.png"
      + storage_account_name   = "presastg"
      + storage_container_name = "pre-b2c-container"
      + type                   = "Block"
      + url                    = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":741,"Program":"tfcmt","SHA1":"","Vars":{}} -->